# Pandas
- is a python library provides high performance DS and Data analysis tools. 
- It runs on top of Numpy. 
- is a data analysis library that provide the concept called Data Frame.

In [60]:
import pandas as pd

In [61]:
import numpy as np

## Data Frame
- A DataFrame is a two-dimensional, labeled data structure with columns that can be of different types. 
- It is similar to a spreadsheet or SQL table and is particularly useful for working with structured data.

#### Creating a Data Frame

In [62]:
df=pd.DataFrame(np.arange(0,12).reshape(3,4),index=("Row1","Row2","Row3"),columns=("Column1","Column2","Column3","Column4"))

In [63]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

#### Accessing Elements of DataFrame

In [64]:
# Accessing a column by name

In [65]:
df["Column1"]

Row1    0
Row2    4
Row3    8
Name: Column1, dtype: int32

In [76]:
df[["Column1","Column3"]]

      Column1  Column3
Row1        0        2
Row2        4        6
Row3        8       10

In [66]:
# Accessing a Row by loc

In [67]:
df.loc['Row3']

Column1     8
Column2     9
Column3    10
Column4    11
Name: Row3, dtype: int32

In [68]:
type(df.loc['Row3'])

pandas.core.series.Series

In [69]:
df.iloc[0:3,1:3]

      Column2  Column3
Row1        1        2
Row2        5        6
Row3        9       10

In [70]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

#### Converting DataFrame to a CSV file
- CSV (Comma-Separated Values) files important in data analysis and manipulation.

In [71]:
df.to_csv('test1_from_2_Pandas.csv')

You will get a csv file whose content is shown below

This can be opened in excel also.

#### Converting CSV to DataFrame
You can create a DataFrame from various sources, such as lists, dictionaries, CSV files, Excel files, and databases. 

The following csv file is created in notepad

In [72]:
df1=pd.read_csv('test2_to_2_Pandas.csv')
df1.head()

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       13       15       16       18

##### head() method 
- is used to display the first few rows of a DataFrame. 
- By default, it shows the first 5 rows, but you can specify the number of rows you want to display by passing an argument to the head() method.

In [73]:
df2=pd.read_csv('test3_Kaggle_to_2_Pandas.csv')
df2.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S

## Data Series

- Series is a one-dimensional labeled array capable of holding any data type. 
- It is similar to a column in a spreadsheet or a single variable in statistics. 
- A Series can be created from various data structures, such as lists, arrays, or dictionaries.

In [74]:
data = [2,3,6,1,9,5,6]
series=pd.Series(data)
print(series)

0    2
1    3
2    6
3    1
4    9
5    5
6    6
dtype: int64

In [75]:
type(series)

pandas.core.series.Series